#include <iostream>
#include "Graph.h"

/*
    ПС-22
    Сафаров Тахир Маратович

    ISO C++ 20
    Visual Studio 22

    Лабораторная № 4
    26) Имеется сеть автомобильных дорог. По  некоторым дорогам
    можно  проехать  только  в одном  направлении. Известна  длина 
    каждой дороги, причем она может быть разной в  зависимости  от 
    направления. Один  из  городов  является  столицей.  Требуется
    вывести список длин вторых по минимальности путей из столицы в 
    другие города. Допускается присутствие циклических путей (12)
*/

int main()
{
    std::cout << "Hello World!\n";
}
